crowdwave/ch559samplestranslated/EVT/EXAM/LED_CTL/LED_Udisk_Flash_DMA/ROOT_UDISKIF.C
/************************************************* ******************************
* Function Name: InitUSB_Host( void)
* Description: Initialize the USB host
* Input: None
* Output: None
* Return: None
************************************************** *****************************/
void InitUSB_Host( void) // initialize the USB host
{
    IE_USB = 0;
    USB_CTRL = bUC_HOST_MODE; // Set the mode first
    USB_DEV_AD = 0x00;
    UH_EP_MOD = bUH_EP_TX_EN | bUH_EP_RX_EN;
    UH_RX_DMA = RxBuffer;
    UH_TX_DMA = TxBuffer;
    UH_RX_CTRL = 0x00;
    UH_TX_CTRL = 0x00;
    USB_CTRL = bUC_HOST_MODE | bUC_INT_BUSY | bUC_DMA_EN; // Start the USB host and DMA, and automatically pause before the interrupt flag is cleared
    UH_SETUP = bUH_SOF_EN;
    USB_INT_FG |= 0xFF; // Clear interrupt flag
    DisableRootHubPort( ); // Clear
    USB_INT_EN = bUIE_TRANSFER | bUIE_DETECT;
}

/************************************************* ******************************
* Function Name: mStopIfError( UINT8 iError)
* Description: Check the operating status, if there is an error, display the error code and stop
* Input: UINT8 iError
* Output: None
* Return: None
************************************************** *****************************/
void mStopIfError( UINT8 iError)
{
    if (iError == ERR_SUCCESS)
    {
        return; /* The operation was successful */
    }
    printf( "Error: %02X\n", (UINT16)iError ); /* display error */
    /* After encountering an error, you should analyze the error code and CH559DiskStatus status. For example, call CH559DiskReady to query whether the current U disk is connected. If the U disk is disconnected, then wait for the U disk to be plugged in and then operate.
       Suggested processing steps after error:
       1. Call CH559DiskReady once, and continue the operation if successful, such as Open, Read/Write, etc.
       2. If CH559DiskReady is unsuccessful, then forcibly start the operation from the beginning (waiting for U disk connection, CH559DiskReady, etc.) */
    while (1)
    {
// LED_TMP=0; /* LED flashes */
// mDelaymS( 100 );
// LED_TMP=1;
// mDelaymS( 100 );
    }
}
